[{"poet_id":0,"poet":"William Shakespeare","poems":[{"id":0,"title":"Sonnet 18","text":"Shall I compare thee to a summer’s day?<br>Thou art more lovely and more temperate:<br>Rough winds do shake the darling buds of May,<br>And summer’s lease hath all too short a date;<br>Sometime too hot the eye of heaven shines,<br>And often is his gold complexion dimm'd;<br>And every fair from fair sometime declines,<br>By chance or nature’s changing course untrimm'd;<br>But thy eternal summer shall not fade,<br>Nor lose possession of that fair thou ow’st;<br>Nor shall death brag thou wander’st in his shade,<br>When in eternal lines to time thou grow’st:<br>So long as men can breathe or eyes can see,<br>So long lives this, and this gives life to thee."},{"id":1,"title":"Sonnet 27","text":"Weary with toil, I haste me to my bed,<br>The dear repose for limbs with travel tired;<br>But then begins a journey in my head,<br>To work my mind, when body's work's expired:<br>For then my thoughts (from far where I abide)<br>Intend a zealous pilgrimage to thee,<br>And keep my drooping eyelids open wide,<br>Looking on darkness which the blind do see:<br>Save that my soul's imaginary sight<br>Presents thy shadow to my sightless view,<br>Which, like a jewel hung in ghastly night,<br>Makes black night beauteous and her old face new.<br>Lo, thus, by day my limbs, by night my mind,<br>For thee, and for myself, no quiet find."},{"id":2,"title":"Sonnet 116","text":"Let me not to the marriage of true minds<br>Admit impediments. Love is not love<br>Which alters when it alteration finds,<br>Or bends with the remover to remove.<br>O no! it is an ever-fixed mark<br>That looks on tempests and is never shaken;<br>It is the star to every wand'ring bark,<br>Whose worth's unknown, although his height be taken.<br>Love's not Time's fool, though rosy lips and cheeks<br>Within his bending sickle's compass come;<br>Love alters not with his brief hours and weeks,<br>But bears it out even to the edge of doom.<br>If this be error and upon me prov'd,<br>I never writ, nor no man ever lov'd."}]},{"poet_id":1,"poet":"William Wordsworth","poems":[{"id":3,"title":"My Heart Leaps Up","text":"My heart leaps up when I behold<br>A rainbow in the sky:<br>So was it when my life began;<br>So is it now I am a man;<br>So be it when I shall grow old,<br>Or let me die!<br>The Child is father of the Man;<br>And I could wish my days to be<br>Bound each to each by natural piety."},{"id":4,"title":"Glad Sight Wherever New With Old","text":"Glad sight wherever new with old<br>Is joined through some dear homeborn tie;<br>The life of all that we behold<br>Depends upon that mystery.<br>Vain is the glory of the sky,<br>The beauty vain of field and grove,<br>Unless, while with admiring eye<br>We gaze, we also learn to love."},{"id":5,"title":"How Beautiful The Queen Of Night","text":"How beautiful the Queen of Night, on high<br>Her way pursuing among scattered clouds,<br>Where, ever and anon, her head she shrouds<br>Hidden from view in dense obscurity.<br>But look, and to the watchful eye<br>A brightening edge will indicate that soon<br>We shall behold the struggling Moon<br>Break forth, again to walk the clear blue sky.."}]},{"poet_id":2,"poet":"Edgar Allan Poe","poems":[{"id":6,"title":"Hymn","text":"At morn--at noon--at twilight dim--<br>Maria! thou hast heard my hymn!<br>In joy and woe--in good and ill--<br>Mother of God, be with me still!<br>When the Hours flew brightly by,<br>And not a cloud obscured the sky,<br>My soul, lest it should truant be,<br>Thy grace did guide to thine and thee;<br>Now, when storms of Fate o'ercast<br>Darkly my Present and my Past,<br>Let my future radiant shine<br>With sweet hopes of thee and thine!"},{"id":7,"title":"Sonnet—— To Science","text":"Science! true daughter of Old Time thou art!<br>Who alterest all things with thy peering eyes.<br>Why preyest thou thus upon the poet’s heart,<br>Vulture, whose wings are dull realities?<br>How should he love thee? or how deem thee wise,<br>Who wouldst not leave him in his wandering<br>To seek for treasure in the jewelled skies,<br>Albeit he soared with an undaunted wing?<br>Hast thou not dragged Diana from her car,<br>And driven the Hamadryad from the wood<br>To seek a shelter in some happier star?<br>Hast thou not torn the Naiad from her flood,<br>The Elfin from the green grass, and from me<br>The summer dream beneath the tamarind tree?"},{"id":8,"title":"An Acrostic","text":"Elizabeth it is in vain you say<br>\"Love not\" — thou sayest it in so sweet a way:<br>In vain those words from thee or L.E.L.<br>Zantippe's talents had enforced so well:<br>Ah! if that language from thy heart arise,<br>Breath it less gently forth — and veil thine eyes.<br>Endymion, recollect, when Luna tried<br>To cure his love — was cured of all beside —<br>His follie — pride — and passion — for he died."}]},{"poet_id":3,"poet":"John Keats","poems":[{"id":9,"title":"Asleep! O Sleep A Little While, White Pearl!","text":"Asleep! O sleep a little while, white pearl!<br>And let me kneel, and let me pray to thee,<br>And let me call Heaven's blessing on thine eyes,<br>And let me breathe into the happy air,<br>That doth enfold and touch thee all about,<br>Vows of my slavery, my giving up,<br>My sudden adoration, my great love!"},{"id":10,"title":"Give Me Women, Wine, And Snuff","text":"Give me women, wine, and snuff<br>Until I cry out \"hold, enough!\"<br>You may do so sans objection<br>Till the day of resurrection;<br>For bless my beard they aye shall be<br>My beloved Trinity."},{"id":11,"title":"On Death","text":"Can death be sleep, when life is but a dream,<br>And scenes of bliss pass as a phantom by?<br>The transient pleasures as a vision seem,<br>And yet we think the greatest pain's to die.<br>How strange it is that man on earth should roam,<br>And lead a life of woe, but not forsake<br>His rugged path; nor dare he view alone<br>His future doom which is but to awake."}]},{"poet_id":4,"poet":"William Butler Yeats","poems":[{"id":12,"title":"A Needle's Eye","text":"All the stream that's roaring by<br>Came out of a needle's eye;<br>Things unborn, things that are gone,<br>From needle's eye still goad it on."},{"id":13,"title":"A Deep-sworn Vow","text":"Others because you did not keep<br>That deep-sworn vow have been friends of mine;<br>Yet always when I look death in the face,<br>When I clamber to the heights of sleep,<br>Or when I grow excited with wine,<br>Suddenly I meet your face."},{"id":14,"title":"A Drinking Song","text":"Wine comes in at the mouth<br>And love comes in at the eye;<br>That's all we shall know for truth<br>Before we grow old and die.<br>I lift the glass to my mouth,<br>I look at you, and I sigh."}]},{"poet_id":5,"poet":"Robert Herrick","poems":[{"id":15,"title":"A caution.","text":"That love last long, let it thy first care be<br>To find a wife that is most fit for thee.<br>Be she too wealthy or too poor, be sure<br>Love in extremes can never long endure."},{"id":16,"title":"A Charm, Or An Allay For Love.","text":" If so be a toad be laid<br>In a sheep's-skin newly flay'd,<br>And that tied to man, 'twill sever<br>Him and his affections ever."},{"id":17,"title":"A Good Death.","text":"For truth I may this sentence tell,<br>No man dies ill, that liveth well."}]},{"poems":[{}]}]